РазработкаОУМобильная/src/Catalogs/УГМК_ТехнологическаяОснастка/УГМК_ТехнологическаяОснастка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УГМК_ТехнологическаяОснастка</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ТипТехоснастки</name>
    <type>
      <types>CatalogRef.УГМК_ТипыТехнологическихОснасток</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочиеЦентрыПоОснастке</name>
    <type>
      <types>CatalogRef.УГМК_ТехнологическаяОснастка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочиеЦентры</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.ГруппыЗаменяемостиРабочихЦентров</types>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительнаяОснастка</name>
    <attributes>
      <name>Оснастка</name>
      <type>
        <types>CatalogRef.УГМК_ТехнологическаяОснастка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РазработкаОУМобильная/src/Catalogs/УГМК_ТехнологическаяОснастка/ObjectModule.bsl
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
 	ОбщегоНазначения.ДобавитьПрефиксУзла( Префикс);
КонецПроцедуры

Функция ИзмененСоставРабочихЦентров()
	Возврат( Истина);	
КонецФункции

Функция ПолучитьПодчиненныеОснастки( ОснасткаСсылка)
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("РабочиеЦентрыПоОснастке",ОснасткаСсылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	УГМК_ТехнологическаяОснастка.Ссылка
	             |ИЗ
	             |	Справочник.УГМК_ТехнологическаяОснастка КАК УГМК_ТехнологическаяОснастка
	             |ГДЕ
	             |	УГМК_ТехнологическаяОснастка.РабочиеЦентрыПоОснастке = &РабочиеЦентрыПоОснастке";
				 
	Возврат( Запр.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Если (не ОбменДанными.Загрузка) и (не ЗначениеЗаполнено( ЭтотОбъект.РабочиеЦентрыПоОснастке)) и ИзмененСоставРабочихЦентров() тогда
		ПодчиненныеОснастки = ПолучитьПодчиненныеОснастки( ЭтотОбъект.Ссылка);
		
		НовыйСоставРЦ = ЭтотОбъект.РабочиеЦентры.Выгрузить();
		Для каждого Оснастка из ПодчиненныеОснастки цикл
			ОснасткаОбъект = Оснастка.ПолучитьОбъект();
			ОснасткаОбъект.РабочиеЦентры.Загрузить( НовыйСоставРЦ);
			ОснасткаОбъект.Записать();
			
			Сообщить("Обновлен элемент: "+Строка( ОснасткаОбъект)+" "+ОснасткаОбъект.ДляПоиска);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
